ghelia/enchantmoon_kernel/linux-3.0/drivers/net/wireless/rtl8723as/hal/rtl8723a/usb/usb_ops_linux.c
	_func_enter_;
	data = val ;
	ret = usb_write_async(udev, addr, &data, 1);
	_func_exit_;	

	return ret;
}

static int usb_async_write16(struct intf_hdl *pintfhdl, u32 addr, u16 val)
{	
	u16 data;
	int ret;
	struct dvobj_priv  *pdvobjpriv = (struct dvobj_priv  *)pintfhdl->pintf_dev;   
	struct usb_device *udev=pdvobjpriv->pusbdev;

	_func_enter_;
	data = val;	
	ret = usb_write_async(udev, addr, &data, 2);
	_func_exit_;	
	
	return ret;
}
static int usb_async_write32(struct intf_hdl *pintfhdl, u32 addr, u32 val)
{	
	u32 data;
	int ret;
	struct dvobj_priv  *pdvobjpriv = (struct dvobj_priv  *)pintfhdl->pintf_dev;   
	struct usb_device *udev=pdvobjpriv->pusbdev;

	_func_enter_;
	data = val;	
	ret = usb_write_async(udev, addr, &data, 4);
	_func_exit_;	
	
	return ret;
}
#endif

static unsigned int ffaddr2pipehdl(struct dvobj_priv *pdvobj, u32 addr)
{
	unsigned int pipe=0;
	int ep_num=0;
	_adapter *padapter = pdvobj->padapter;
	struct usb_device *pusbd = pdvobj->pusbdev;	
	HAL_DATA_TYPE *pHalData = GET_HAL_DATA(padapter);

	if(addr == RECV_BULK_IN_ADDR)
	{	
		//pipe=usb_rcvbulkpipe(pusbd, 0x01);
		pipe=usb_rcvbulkpipe(pusbd, 0x04);

		return pipe;
	}

	if(addr == RECV_INT_IN_ADDR)
	{	
		pipe=usb_rcvbulkpipe(pusbd, 0x07);

		return pipe;
	}

	if(addr < HW_QUEUE_ENTRY) 
	{
		ep_num = (pHalData->Queue2EPNum[(u8)addr] & 0x0f);
		
		pipe = usb_sndbulkpipe(pusbd, ep_num);

		return pipe;
	}

	return pipe;

}

static void usb_bulkout_zero_complete(struct urb *purb, struct pt_regs *regs)
{	
	struct zero_bulkout_context *pcontext = (struct zero_bulkout_context *)purb->context;

	//DBG_8192C("+usb_bulkout_zero_complete\n");
	
	if(pcontext)
	{
		if(pcontext->pbuf)
		{			
			rtw_mfree(pcontext->pbuf, sizeof(int));	
		}	

		if(pcontext->purb && (pcontext->purb==purb))
		{
			usb_free_urb(pcontext->purb);
		}

	
		rtw_mfree((u8*)pcontext, sizeof(struct zero_bulkout_context));	
	}	
	

}

static u32 usb_bulkout_zero(struct intf_hdl *pintfhdl, u32 addr)
{	
	int pipe, status, len;
	u32 ret;
	unsigned char *pbuf;
	struct zero_bulkout_context *pcontext;
	PURB	purb = NULL;	
	_adapter *padapter = (_adapter *)pintfhdl->padapter;
	struct dvobj_priv *pdvobj = (struct dvobj_priv *)&padapter->dvobjpriv;	
	struct usb_device *pusbd = pdvobj->pusbdev;

	//DBG_8192C("+usb_bulkout_zero\n");
	
		
	if((padapter->bDriverStopped) || (padapter->bSurpriseRemoved) ||(padapter->pwrctrlpriv.pnp_bstop_trx))
	{		
		return _FAIL;
	}
	

	pcontext = (struct zero_bulkout_context *)rtw_zmalloc(sizeof(struct zero_bulkout_context));

	pbuf = (unsigned char *)rtw_zmalloc(sizeof(int));	
    	purb = usb_alloc_urb(0, GFP_ATOMIC);
      	
	len = 0;
	pcontext->pbuf = pbuf;
	pcontext->purb = purb;
	pcontext->pirp = NULL;
	pcontext->padapter = padapter;

	
	//translate DMA FIFO addr to pipehandle
	//pipe = ffaddr2pipehdl(pdvobj, addr);	

	usb_fill_bulk_urb(purb, pusbd, pipe, 
       				pbuf,
              			len,
              			usb_bulkout_zero_complete,
              			pcontext);//context is pcontext

	status = usb_submit_urb(purb, GFP_ATOMIC);

	if (!status)
	{		
		ret= _SUCCESS;
	}
	else
	{
		ret= _FAIL;
	}
	
	
	return _SUCCESS;

}

static void usb_read_mem(struct intf_hdl *pintfhdl, u32 addr, u32 cnt, u8 *rmem)
{
	
}

static void usb_write_mem(struct intf_hdl *pintfhdl, u32 addr, u32 cnt, u8 *wmem)
{
	
}

#ifdef CONFIG_USB_INTERRUPT_IN_PIPE
#if 0
/**
* Log the Interrupt value and update counter no matter STA is associated or not. It is 
* implemented for FPGA verification stage because we need to now whether the current FPGA 
* platform is alive
*
* \param pAdapter			The adapter context for this minoport
* \param	IsrContent		The ISR value read from hardware in MPISR
*
* We sholud remove this function later because DDK suggest not to executing too many 
* operations in MPISR
*/
VOID
LogInterruptHistory8723AU(
	PADAPTER			Adapter	
)
{
	HAL_DATA_TYPE	*pHalData=GET_HAL_DATA(Adapter);

//	if(pHalData->IntArray[0] & IMR_COMDOK)
//		pHalData->InterruptLog.nIMR_COMDOK++;
	if(pHalData->IntArray[0] & UHIMR_VODOK) 
	{
		pHalData->InterruptLog.nIMR_VODOK++;
		DBG_8192C("UHIMR_VODOK %d \n", pHalData->InterruptLog.nIMR_VODOK);
	}
	if(pHalData->IntArray[0] & UHIMR_VIDOK) 
	{
		pHalData->InterruptLog.nIMR_VIDOK++;
		DBG_8192C("UHIMR_VIDOK %d\n", pHalData->InterruptLog.nIMR_VIDOK);		
	}
	if(pHalData->IntArray[0] & UHIMR_MGNTDOK) 
	{
		pHalData->InterruptLog.nIMR_MGNTDOK++;	
		DBG_8192C("UHIMR_MGNTDOK %d\n", pHalData->InterruptLog.nIMR_MGNTDOK);				
	}
	if(pHalData->IntArray[0] & UHIMR_BEDOK) 
	{
		pHalData->InterruptLog.nIMR_BEDOK++;
		DBG_8192C("UHIMR_BEDOK %d\n", pHalData->InterruptLog.nIMR_BEDOK);				
	}
	if(pHalData->IntArray[0] & UHIMR_BKDOK) 
	{
		pHalData->InterruptLog.nIMR_BKDOK++;
		DBG_8192C("UHIMR_BKDOK %d\n", pHalData->InterruptLog.nIMR_BKDOK);				
	}
	if(pHalData->IntArray[0] & UHIMR_ROK)
	{
		pHalData->InterruptLog.nIMR_ROK++;
		DBG_8192C("UHIMR_ROK %d\n", pHalData->InterruptLog.nIMR_ROK);				
	}

	if(pHalData->IntArray[0] & UHIMR_TXBCNOK) 
	{
		pHalData->InterruptLog.nIMR_TBDOK++;
		DBG_8192C("UHIMR_TXBCNOK %d\n", pHalData->InterruptLog.nIMR_TBDOK);				
	}
	if(pHalData->IntArray[0] & UHIMR_BCNDOK0) 
	{
		pHalData->InterruptLog.nIMR_BDOK++;
		DBG_8192C("UHIMR_BCNDOK0 %d\n", pHalData->InterruptLog.nIMR_BDOK);				
	}
	if(pHalData->IntArray[0] & UHIMR_C2HCMD) 
	{
		pHalData->InterruptLog.nIMR_C2HCMD++;
		DBG_8192C("UHIMR_C2HCMD %d\n", pHalData->InterruptLog.nIMR_C2HCMD);						
	}
	if(pHalData->IntArray[0] & UHIMR_CPWM) 
	{
		pHalData->InterruptLog.nIMR_C2HCMD++;
		DBG_8192C("UHIMR_CPWM %d\n", pHalData->InterruptLog.nIMR_CPWM);						
	}

//	if(pHalData->IntArray[0] & IMR_RXCMDOK)
//		pHalData->InterruptLog.nIMR_RCOK++;
	if(pHalData->IntArray[0] & UHIMR_RDU)
	{
		pHalData->InterruptLog.nIMR_RDU++;
		DBG_8192C("UHIMR_RDU %d\n", pHalData->InterruptLog.nIMR_RDU);						
	}

	if(pHalData->IntArray[1] & UHIMR_RXFOVW)
	{
		pHalData->InterruptLog.nIMR_RXFOVW++;
		DBG_8192C("UHIMR_RXFOVW %d\n", pHalData->InterruptLog.nIMR_RXFOVW);						
	}


}
#endif
//
// Description:
//	Recognize the interrupt content by reading the interrupt register or content and masking interrupt mask (IMR)
//	if it is our NIC's interrupt. After recognizing, we may clear the all interrupts (ISR).
// Arguments:
//	[in] Adapter -
//		The adapter context.
//	[in] pContent -
//		Under PCI interface, this field is ignord.
//		Under USB interface, the content is the interrupt content pointer.
//		Under SDIO interface, this is the interrupt type which is Local interrupt or system interrupt.
//	[in] ContentLen -
//		The length in byte of pContent.
// Return:
//	If any interrupt matches the mask (IMR), return TRUE, and return FALSE otherwise.
//
BOOLEAN
InterruptRecognized8723AU(
	IN	PADAPTER			Adapter,
	IN	PVOID				pContent,
	IN	u32				ContentLen
)
{
	HAL_DATA_TYPE	*pHalData=GET_HAL_DATA(Adapter);
	u8 *			buffer = (u8 *)pContent;
//	RT_PRINT_DATA(COMP_RECV, DBG_LOUD, ("InterruptRecognized8723AU Interrupt buffer \n"), buffer, MAX_RECEIVE_INTERRUPT_BUFFER_SIZE(Adapter));			
	if(buffer[0]!= 0){
		_rtw_memcpy(&(pHalData->C2hArray[0]), &(buffer[0]), 16);
	}

	_rtw_memcpy(&(pHalData->IntArray[0]), &(buffer[USB_INTR_CONTENT_HISR_OFFSET]), 4);
//	PlatformMoveMemory(&(pHalData->IntArray[0]), &(buffer[USB_INTR_CONTENT_HISR_OFFSET]), sizeof(u4Byte));
//	DBG_8192C("InterruptRecognized8723AU HISR = 0x%x HIMR = 0x%x\n", pHalData->IntArray[0],pHalData->IntrMask[0]);	
	pHalData->IntArray[0] &= pHalData->IntrMask[0];

	//For HISR extension. Added by tynli. 2009.10.07.
	_rtw_memcpy(&(pHalData->IntArray[1]), &(buffer[USB_INTR_CONTENT_HISRE_OFFSET]), 4);
//	PlatformMoveMemory(&(pHalData->IntArray[1]), &(buffer[USB_INTR_CONTENT_HISRE_OFFSET]), sizeof(u4Byte));	
//	DBG_8192C("InterruptRecognized8192CUsb HISRE = 0x%x HIMRE = 0x%x\n", pHalData->IntArray[1], pHalData->IntrMask[1]); 
	pHalData->IntArray[1] &= pHalData->IntrMask[1];	

	// We sholud remove this function later because DDK suggest not to executing too many operations in MPISR
//	if(pHalData->IntArray[0] != 0)
//		LogInterruptHistory8723AU(Adapter);

	{
		struct reportpwrstate_parm report;
		_rtw_memcpy(&report.state, &(buffer[USB_INTR_CPWM_OFFSET]), 1);
#ifdef CONFIG_LPS_LCLK
		if( ((pHalData->IntArray[0])&UHIMR_CPWM)){
//			DBG_8192C("%s HIMR=0x%x\n",__func__,pHalData->IntArray[0]);
			cpwm_int_hdl(Adapter, &report);
			pHalData->IntArray[0]&= ~UHIMR_CPWM;
//			DBG_8192C("%s HIMR=0x%x\n",__func__,pHalData->IntArray[0]);
		}
#endif
	}
	return (((pHalData->IntArray[0])&pHalData->IntrMask[0])!=0 || 
		((pHalData->IntArray[1])&pHalData->IntrMask[1])!=0);

